<template lang="html">
<div class="">
  <p>上海云盾信息技术有限公司在没有经过您允许的情况下不会出售、出租或者以任何方式透漏您的私人信息。我们最主要的隐私原则是您提供 给我们的任何个人信息将作为隐私。我们不假设您准予我们向您允许或未允许的想要贩卖您产品或服务的第三方共享您的私人信息。为了使我们提供某些服务，我们 有时可能需要提供一些您提供给我们的外部信息。在有需要时，我们将向您提供明确的通知，并提供选择退出的权利。上海云盾信息技术有限公司可能需要时常从它的系统清除信息，不承 诺任何超出了所适用的法律或法规要求的信息。</p>
  <article>
    <section v-for="item in privacy">
      <h3>{{item.title}}</h3>
      <p>{{item.content}}</p>
    </section>
  </article>
</div>
</template>

<script>
export default {
  data() {
    return {
      privacy: [{
        title: '作为公共指定信息',
        content: '作为我们服务的一部分，您可以决定提供特别的信息与第三方共享。例如，您允许我们能够记录曾经有什么恶意访客访问过您站点的统计报告。在这种情况下，我们 将尽量保障您提供给我们的任何将被公开的信息的明确性。即使您给了我们公开某些信息的权限，我们仍将从被披露的信息中保护那些被指定为私人的信息（如您的 姓名、电子邮件地址和其它特别标记为您的身份的信息）。'
      }, {
        title: '信息收集',
        content: '上海云盾信息技术有限公司是本网站和通过任何上海云盾信息技术有限公司服务收集到的信息的唯一拥有者。当访问者浏览我们的网站或者通过上海云盾信息技术有限公司保护的您的站点，我们有时会跟踪他们以提供更好的服务。'
      }, {
        title: '更正个人信息',
        content: '这个网站可以很容易地于任何时间更正您个人信息的任何错误。只要有可能，我们会给您机会来审查并更改您给我们提供的信息。如果您注意到您提供给我们的信息中有错误，您可以随时修改。这可以在线完成或者直接与我们联系。'
      }, {
        title: 'COOKIES',
        content: '为了给我们的用户提供更好的服务，我们的网站使用“cookies”。Cookies是由您的浏览器在您计算机硬盘上放置的您的计算机的唯一标识。上海云盾信息技术有限公司不 会储存那些被我们在cookie中认为是私人的或者私有的信息。这消除了其他网站通过阅读我们的cookie并了解您个人或私人信息的机会。相反，我们使 用cookie来帮助指导您到我们网站的适当的部分。比如，cookie可能表明您是我们网站的重复访问者。如果您不想让上海云盾信息技术有限公司或者其他的网站使用 cookies，您可以在您的浏览器中禁用它们。上海云盾信息技术有限公司网站的某些部分在没有cookies的情况下仍任能够起作用。如果您特别想要删除被放置在您浏览器中 的所有cookies，请意识到这将重置您的会话，禁用自动登陆，并且可能给在上海云盾信息技术有限公司网站的其他功能造成不利影响。您可以选择允许上海云盾信息技术有限公司放置cookies在您受上海云盾信息技术有限公司保护站点上面的浏览器中。我们这样做是为了跟踪恶意访客并减少阻塞合法用户的机会。如果您希望，您可以始终选择退出我们放置在您访问者的浏览器上的cookies。'
      }, {
        title: '数据收集',
        content: '上海云盾信息技术有限公司收集数据，我们可能会获得有关您和您网站访问者的数据。例如，我们可能会收集数据以确定网页爬虫如何在互联网中爬行以及它们是否在从事恶意活动。如果 我们收集这类数据并提供给外部各方，您的私人信息（比如您的名字、电子邮件地址，其他标识您身份的具体信息）将永远不会被包含于这些收集的数据中。请注 意，您提供给我们的公共数据，比如您网站访问者的日志文件，可能包含在汇总数据、报告和统计资料中。'
      }, {
        title: '推广伙伴',
        content: '有时，上海云盾信息技术有限公司可能会通知您我们网站上的上海云盾信息技术有限公司推广伙伴的邀约。虽然我们可能为这些邀约找到特定类型的使用者，不过我们将会在我们的系统内完整地查找。我们的商 业伙伴将不会拥有任何访问目标的信息，包括对特殊产品或服务感兴趣的人的姓名。直到您积极地响应这些邀约，否则我们将不会对任何伙伴透漏关于您的任何关于 身份识别的信息。'
      }, {
        title: '第三方网站',
        content: '上海云盾信息技术有限公司网站和其他网站包含第三方网站的链接。请注意，我们不对这些外部网站的隐私行为负责。我们鼓励用户注意了解他们什么时候离开我们的网站，并阅读其他网站的隐私声明。我们不能保证这些第三方遵守此处列出的隐私原则。'
      }, {
        title: '法院命令',
        content: '上海云盾信息技术有限公司可能被法庭要求提供包含在我们网站的信息。上海云盾信息技术有限公司可能还需要提供依据法律、适用的法规、传票或其他法律程序的信息。在这些条件下，我们将尽可能告知所有用户我们必须披露的信息。'
      }, {
        title: '更改通知',
        content: '我们将始终坚持这一原则：我们不会出售、出租或泄露任何未经您同意与我们共享的个人信息。我们认为我们日后将改变这一原则，但是，如果我们确实需要改变政策的任何其他方面，我们将在网站上公布这些变化。'
      }]
    }
  }
}
</script>

<style lang="css">

</style>
