<template lang="html">
<div class="">
  <p>上海云盾信息技术有限公司，提供www.yundun.com（“yundun.com”）的网站，此域名下的所有内容和它为您提供的服务 受制于以下条款和条件。使用yundun.com，也就说明您同意最新修订版本的协议和上海云盾信息技术有限公司的隐私和安全策略（请参阅下面的“条款修订”）。</p>
  <article>
    <section v-for="item in service">
      <h3>{{item.title}}</h3>
      <p>{{item.content}}</p>
    </section>
  </article>
</div>
</template>

<script>
export default {
  data() {
    return {
      service: [{
        title: '第一条：接受这些条件',
        content: '通过使用yundun.com的信息，工具，特征和功能，借助任何上海云盾信息技术有限公司的API，或者经由yundun.com接口的任何软件、其它网站，或者它的API(统 称“服务”)，都表示您同意遵守本协议，无论您是一个“访客“（表示您只是浏览yundun.com网站），或者您是一个“成员”（意思是您注册了上海云盾信息技术有限公司）。 术语“您”或“用户”指的是访客或者成员。如果您想成为成员并使用该服务，您必须阅读本协议，表明您在注册过程中接受了此协议。如果您接受此协议，则表示 您有能力受其约束，或者，如果您代表了一个公司或实体，您有权使该实体受其约束。'
      }, {
        title: '第二条：版权',
        content: 'yundun.com包含的所有内容，比如文本，图形，徽标，按钮图标，图像，音频剪辑，数码下载，数据编译，软件以及内容汇编成一体的，连贯的网站都属于上海云盾信息技术有限公司，并受中国和国际版权法的保护。严禁未经上海云盾信息技术有限公司书面允许即对其内容进行复制。'
      }, {
        title: '第三条：商标和服务标记',
        content: '上海云盾信息技术有限公司标志和其他上海云盾信息技术有限公司图形，标识，网页标题，按钮图标，脚本和服务名称均为上海云盾信息技术有限公司或其子公司的商标，证明商标，服务标记，或其它商业外观。上海云盾信息技术有限公司 的商标，证明商标，服务商标和商业外观由于它们的限制使用而具有固有的意义和重大的价值。它们不会用于未经上海云盾信息技术有限公司许可的任何有关产品或服务。所有在 yundun.com出现的不属于上海云盾信息技术有限公司或其子公司的商标均为其各自所有者所拥有，可能或可能不是由上海云盾信息技术有限公司或它子公司所隶属、相关联或赞助的。'
      }, {
        title: '第四条：访问yundun.com和服务的许可证',
        content: '考虑到访问yundun.com和其服务，上海云盾信息技术有限公司授予您一个访问网站和用于个人使用的有限许可。本许可协议禁止您下载（除了页面缓存），或修改它的任何部分， 除非得到上海云盾信息技术有限公司明确的书面同意。该协议不允许转售上海云盾信息技术有限公司的服务。在未经yundun.com明确书面同意的情况下，您不得使用框架技术框架或附上任何商标、标识 或其它专有(包括图像、文本、网页布局或表单)的信息。您在没有经过上海云盾信息技术有限公司明确书面同意的情况下不可以使用任何元数据标签和利用上海云盾信息技术有限公司名称或商标的任何其它 “隐藏文本”。任何未经授权的使用自动终止了上海云盾信息技术有限公司授予的允许或许可，并可能产生各种损害赔偿的法律责任。您被授予有限的，可撤销的，非独有性的权利来创建至任何非密码保护的目录的超链接，只要这个链接不以虚假、误导、诽谤或其它冒犯性的内容来描绘上海云盾信息技术有限公司、其所属网站或它的服务。您在未经书面许可的情况下不能使用任何上海云盾信息技术有限公司专有的图形或商标作为链接的一部分。'
      }, {
        title: '第五条：账户和密码',
        content: '如果您发布一个账户，您需自行负责维护您的账户和密码的机密性，并且您同意接受对在您的账户或密码下发生的所有活动负责。上海云盾信息技术有限公司保留以下权利：自行裁定权，拒绝服务，暂停或终止账户，或以其他方式限制访问yundun.com和上海云盾信息技术有限公司的服务。'
      }, {
        title: '第六条：自动安装工具的使用',
        content: '您可以选择允许上海云盾信息技术有限公司访问您同意的第三方，比如DNS提供商和注册商，以便完成自动注册的过程。如果您选择这样做，您即明确授权上海云盾信息技术有限公司做为您的代理以您的名义 维护、访问和更新确认的第三方的账户信息。当您使用本服务的自动安装功能，您将被直接连接到您确定的第三方网站。上海云盾信息技术有限公司将提供包括用户名和密码的信息登录到 您提供的网站。您在此授权，并允许上海云盾信息技术有限公司使用由您提供的信息给服务（如账户密码和用户名）来完成上述配置和服务，以便它与您提交您的信息的第三方网站兼容。 上海云盾信息技术有限公司储存您用户名和密码的时间不会超过完成您请求的必要时间或者您当前yundun.com会话的时长。就本协议的目的且作为服务的一部分仅提供账户信息， 您授予上海云盾信息技术有限公司一个有限的授权委托书，并委任上海云盾信息技术有限公司作为您的代理人和媒介，来访问第三方网站，以全部的权利来检索和更新您的信息并且有权在这些活动连接的状态下 去做和执行每一件必要的事情，就像您个人在做一样。您承认并同意，当上海云盾信息技术有限公司正在从第三方网站访问和检索账户信息时，上海云盾信息技术有限公司是作为您的代理人，而不是作为作者或 者代表第三方。您了解并同意本服务并不是由通过服务的任何第三方主办赞助的或赞同的。'
      }, {
        title: '第七条：您的内容',
        content: '您保留所接受的上海云盾信息技术有限公司服务的任何材料的全部版权。根据您选择的功能，上海云盾信息技术有限公司可以修改网站的内容。比如，上海云盾信息技术有限公司可以检测到邮件地址并且用脚本替换它们以防止被别人截获。您承认上海云盾信息技术有限公司可以：从访问您网站的内容中选择高度敏感的信息，为了隐藏而重写它们。添加cookie到您的域来跟踪访问者，比如那些已经成功通过验证码的访问者。对先前没有跟踪或者隶属的代码增加追踪或隶属的代码链接。向您的页面增加脚本，比如，添加服务或者执行额外的性能追踪。拦截确定为威胁的请求并且将它们在页面上展现出来。为您的网站提高性能和安全的其它改变。'
      }, {
        title: '第八条：访问者使用和滥用yundun.com的记录',
        content: '作为yundun.com的访问者和上海云盾信息技术有限公司服务的使用者，您同意为防止滥用，您的互联网协议地址被记录并且您的活动被监控。滥用情况包括但不限于：试图通过密码挖掘或任何其它方式来获取服务、其它账户、计算机系统或服务的网络链接的越权存取。传输任何含有病毒、特洛伊木马、蠕虫、定时炸弹、删除蝇或其它任何有害或有毒的程序。干扰或破坏连接到服务的网络或违反法规、政策或此类网络的规程。创建虚假身份或另有企图误导他人利用yundun.com用户的身份。有意或无意地违反任何适用的当地，国家或国际法律。'
      }, {
        title: '第九条：您访客的记录',
        content: '作为上海云盾信息技术有限公司服务的一部分，您可以选择监控某些网站的流量。在这种情况下，您承认上海云盾信息技术有限公司充当您的受限的代理，以向您提供互联网数据和优化服务为目的。您承认这是 您的责任：确定上海云盾信息技术有限公司服务的使用是您司法管辖区的法律所允许的，并且如果您的服务的使用违反当地的法律，您同意赔偿并且保持上海云盾信息技术有限公司是无恶意的。凡是您同意的需 要发送隐私策略的法律要求，作为最低要求，需要公开任何您收集的个人信息的使用，其中也包括通过Service收集的信息。您同意赔偿和捍卫上海云盾信息技术有限公司免受因您 未能遵守本规定和/或您的失败而产生的或拒绝遵守的上海云盾信息技术有限公司规定的条款和任何适用的隐私政策而产生的任何索赔。'
      }, {
        title: '第十条：限制非缓存的HTML',
        content: '您承认上海云盾信息技术有限公司的服务提供一个平台，高速缓存服务web页和web站点，且并不适用于其他用途，例如远程存储。您理解并同意使用服务来管理和发布网页，通过浏 览器，HTML或其他技术提供客户端视图。上海云盾信息技术有限公司的服务也是一个共享的web缓存服务，意味着大量的客户网站是从同一服务器缓存。为确保上海云盾信息技术有限公司的服务是可靠的 并且对于大多数用户来说是有效的，一个客户的使用不能对其它客户网站的性能产生不利的影响。此外，上海云盾信息技术有限公司的服务目的是承载网站，而不是存储数据。使用一个账 户主要作为在线存储空间，包括存储或缓存一个不成比例的图片、电影、音频文件或其它非HTML内容是被禁止的。您同意，如果根据上海云盾信息技术有限公司的自行决定权您被认为 违反了这部分，或者带给上海云盾信息技术有限公司系统不当的负担或潜在的不利影响，或者带给其它用户、服务器处理能力、服务器内存潜在的不良影响，滥用控件或其它原因，上海云盾信息技术有限公司可 以暂停或终止您的账户，恕不另行通知。'
      }, {
        title: '第十一条：禁止使用',
        content: '您不得通过上海云盾信息技术有限公司的服务张贴、传达、传播、缓存或存储材料，上海云盾信息技术有限公司自行判断以下情况:(a)违反了任何本地、国家或外国法律或法规；(b)具有威胁性、淫秽、 不雅、诽谤、或可能对任何个人，团体，或实体（统称为"人"）产生负面影响；(c)违反任何人的权利，包括著作权，商业秘密保护的权利，专利或其他知识产 权或类似的法律或法规，包括但不限于安装未经许可的“盗版”或其他不恰当的软件。您同意您在不知情的情况下使用这项服务，此外：\n上传，张贴，传送或以其他方式提供违法、有害、威胁、辱骂、骚扰、侵权、诽谤、粗俗、淫秽、侵犯他人隐私的内容，仇恨或种族，民族歧视的内容，或其他不良的内容；\n以任何方式伤害未成年人；\n冒充任何人或实体，包括但不限于上海云盾信息技术有限公司官方和论坛领袖，引导或主持，或以虚假陈述或谎称与任何人或实体的从属关系；\n为了伪装通过服务传输内容的来源而伪造标题或其他操纵标识符；\n上传、张贴、传输或以其它方式散布依据法律、合同或代理关系无权散布的内容（如内部消息，通过雇用关系得知的或属于所签署保密协议的专属及机密资料）；\n上传，张贴，传送或以其他方式提供任何侵犯专利，商标，商业秘密，版权或其他任何一方的专有权利；\n上传，张贴，传送或以其他方式提供任何未经请求或授权的广告，宣传材料，“垃圾邮件”，“垃圾信息”，“连锁信”，“传销”或类似的信息；\n上传，张贴，传送或以其他方式提供任何包含软件病毒或其他计算机代码，文件或设计来中断，破坏或限制任何计算机软件，硬件或通讯设备功能；\n干扰或破坏本服务或服务器或连接到服务的网络，或违反连接到服务的网络的任何规定，规程，政策或法规；\n有意或无意地违反，企图侵犯，或规避任何适用ICANN的规定或政策；\n有意或无意地违反任何适用的当地、国家或国际法律，包括但不限于由中国证券和证券交易委员会公布的任何规则，任何国家或者其它证券交易所的任何规则（包括但不限于中国证券交易所，纳斯达克）和任何具有法律效力的法规；\n向任何恐怖组织或个人提供资金、物资和筹集资金、物资或者主动提供恐怖组织活动的地方；\n“跟踪”或以其他方式骚扰他人；\n宣传或提供有关非法活动的指导信息，协助针对任何团体或个人的人身伤害或损害，或推广任何虐待动物的行为。\n您同意保护上海云盾信息技术有限公司，并且使其不受损害您或者其它团体的使用而造成的任何索赔。上海云盾信息技术有限公司有权调查您，您的业务，和/或您的业主，管理人员，董事，经理及其他负责 人，您的网站，以及在任何时间地点组成的材料。这些调查的进行纯粹为上海云盾信息技术有限公司的利益，而不是为了您或任何第三方的利益。如果调查结果显示任何信息，行为或疏 忽，被上海云盾信息技术有限公司的单方面认为违背了任何地方，国家或外国法律或法规，或违反本协议，上海云盾信息技术有限公司可能会立即关闭该服务。您同意放弃任何因反对上海云盾信息技术有限公司的这种措施而以此为诉 因或者要求索赔'
      }, {
        title: '第十二条：赔偿',
        content: '您同意赔偿并且保护上海云盾信息技术有限公司和它的子公司，支部，职员，代理人，联合品牌或其他合作伙伴、员工，因您使用本服务或连接到服务而违反了服务条款，或对其他人的任何权利的侵犯而被提出的索赔，包括合理的律师费用。'
      }, {
        title: '第十三条：免责声明及责任限制',
        content: 'yundun.com是由上海云盾信息技术有限公司基于“原样”及“现有”为基础提供。上海云盾信息技术有限公司关于yundun.com的运作，其服务的有效性，或信息，内容，材料或包含在 yundun.com的产品，不做任何声明或提供任何形式的明示或暗示的保证。您明确同意，您对yundun.com的使用是自担风险的。为最大程度地适用于 法律允许的情况，上海云盾信息技术有限公司否认所有包括明示或暗示的担保，但不限于隐含的商业授权和为一个特殊目的的适用性。上海云盾信息技术有限公司会尽一切努力，但并不能保证 yundun.com，其服务器，或电子邮件从它的任何域名中传送病毒或其他有害成分。上海云盾信息技术有限公司对由yundun.com的使用，包括但不限于直接的、间接的、附 带的、惩罚性的和间接损害而产生的任何类型的损害赔偿是无责任的。某些国家不允许限制隐含的保证或排除或限制某些损害赔偿。如果这些法律的部分或上述免责 声明适用于您，排除或限制可能对您不适用的，您也可能有额外的权利'
      }, {
        title: '第十四条：终止',
        content: '上海云盾信息技术有限公司的政策是调查违反这些条款和终止重复侵权者。您同意上海云盾信息技术有限公司可在某些情况下，在不事先通知的情况下，立即终止您的上海云盾信息技术有限公司账户、任何关联的电子邮件地址和 yundun.com和相关的服务的访问。终止的原因包括但不限于：(a)对于我们的服务条款或其他合并协议或指导方针的违反或违背；(b)执法部门或其他 政府机构的要求；(c)您的请求(自主账户删除)；(d)对服务（或其中任何部分）的终止或重大修改；(e)突发技术或安全问题；(f)长期限制；(g) 您有从事或有合理理由被怀疑从事欺诈或非法的活动;(h)为您的账户提供了部分虚假资料；(i)未保持您账户的完整性，真实性，准确性；(j)任何触犯上 述上海云盾信息技术有限公司禁止条列的行为；(k)您有与yundun.com和相关服务有关的任何费用拖欠。此外，上海云盾信息技术有限公司只负责上海云盾信息技术有限公司保护之下的终端，对于用户自己或第三方的账 户、服务以及已中断了上海云盾信息技术有限公司保护的终端，上海云盾信息技术有限公司概不负责。您明确同意终止原因的情况下，您进一步承认和同意，即使有任何终止，您对于上海云盾信息技术有限公司提出的第 9,10,11,12和13条规定的义务终止后仍然有效。'
      }, {
        title: '第十五条：DMCA（数字千年版权法案）',
        content: '上海云盾信息技术有限公司是一个传递网络，并在大多数情况下为提高网络性能而在有限的周期内缓存内容。上海云盾信息技术有限公司从我们的缓存自动删除内容时，它已从原始网络服务器移除了。对此有所顾虑的版权所有者，可以将您所担心的问题及网站的IP地址发送邮件至：上海云盾信息技术有限公司信息技术有限公司上海市闵行区中春路7001号F栋705室support@yundun.com您确认上海云盾信息技术有限公司可根据自己的判断， 向那些已经和我们提起投诉的所谓版权人透漏您web服务器的IP地址。 '
      }, {
        title: '第十六条：修订',
        content: '上海云盾信息技术有限公司可以不时地修订本协议。任何以及所有本协议的更改都将张贴在yundun.com上面。此外，该协议将一直显示它上次修改的日期。您将被视为接受并同意在那些更改被贴出后，您在使用服务时受任何修改的协议所约束。'
      }, {
        title: '第十七条：链接',
        content: '该服务会提供，或第三方可能提供其他万维网网站或资源的链接。由于上海云盾信息技术有限公司不会对此类网站和资源的控制，您承认并同意上海云盾信息技术有限公司不对此类外部网站或资源的可用性负 责，不认可，也不对任何内容，广告，产品，材料或源于此类网站或资源负责任。您进一步承认和同意，上海云盾信息技术有限公司对使用、依赖任何此类内容而造成的损失，直接或间接 的任何损害，概不负责或承担赔偿责任。'
      }, {
        title: '第十八条：无第三方受益者',
        content: '您同意，除非另有明文服务条款的规定，否则，对于此协议不得有第三方受益者。'
      }, {
        title: '第十九条：弃权',
        content: '对上海云盾信息技术有限公司未行使或执行任何权利或本协议的规定，不构成对前述权利或规定的放弃。如果任何服务条款的规定经有管辖权的法院认定为无效，当事人依然同意法院应努力使反映在规定中的意图生效，而本条款的其他规定服务仍然具有十足效力及作用。'
      }, {
        title: '第二十条：可分割性条款',
        content: '如果任何服务条款的规定经有管辖权的法院认定为无效，当事人依然同意法院应努力使反映在规定中的意图生效，而本条款的其他规定服务仍然具有十足效力及作用。'
      }, {
        title: '第二十一条：不可转让账户',
        content: '您同意您的上海云盾信息技术有限公司账户非经上海云盾信息技术有限公司的书面同意不得转让。'
      }, {
        title: '第二十二条：索赔时限',
        content: '您同意无论任何法规和法律相反，任何索赔或因本协议而引起的或与yundun.com使用有关的诉讼必须在索赔或诉讼等原因发生的一年内提出，否则被永远禁止。'
      }, {
        title: '第二十三条：适用法律',
        content: '通过访问yundun.com，您同意中国的法律，不考虑法律冲突原则，将控制这些使用条件和上海云盾信息技术有限公司可能出现和您之间或其关联公司的任何种类的任何争议。任何争议或索赔引起的或与本协议有关的判定应在中国北京。'
      }, {
        title: '第二十四条：标题',
        content: '标题和服务条款之标题仅为方便起见，并没有法律或合同的效力。'
      }, {
        title: '第二十五条：屏蔽',
        content: '如果政府或监管机构要求，上海云盾信息技术有限公司可以暂时屏蔽页面甚至整个网站，但上海云盾信息技术有限公司会同时通知用户。'
      }]
    }
  }
}
</script>

<style lang="css">

</style>
