<template lang="html">
<div class="agreement">
  <h1>红网卫士服务协议</h1>
  <p>
    根据《中华人民共和国合同法》及相关法律的规定，上海云盾本着真诚合作，互惠互利的原则，经过友好协商，就上海云盾向您提供《YUNDUN-红网卫士软件》（以下简称红网卫士）服务事宜达成如下协议，以资双方共同遵守。
  </p>
  <div class="section">
    <p>
      <strong>一、定义</strong>
    </p>
    <p>
      1.1.Web应用防火墙: Web应用防火墙(英文：Web Application Firewall，简称：WAF)是通过执行一系列针对HTTP/HTTPS的安全策略来专门为Web应用提供保护的一款安全产品。
    </p>
    <p>
      1.2.红网卫士：上海云盾向您提供的WEB应用防火墙产品和服务以及相关的技术及网络支持服务。
    </p>
    <p>
      1.3.云平台：上海云盾为您提供服务的云计算资源（如Web应用防火墙服务、网络带宽、存储空间等）所组
    </p>
    <p>
      <strong>二、     您的权利和义务</strong>
    </p>
    <p>
      2.1.     您同意遵守本合同以及上海云盾官方网站展示的红网卫士服务页面的相关管理规范及流程。您了解上述协议及规范等的内容可能会不时变更。如合同的任何内容发生变动，上海云盾应通过提前30天在www.yundun.com 的适当版面公告向您提示修改内容。如您不同意上海云盾对服务条款所做的修改，您有权停止使用上海云盾的服务，此等情况下，上海云盾应与您进行服务费结算（如有），并且您应将业务迁出。如您继续使用上海云盾服务，则视为您接受上海云盾对服务条款相关条款所做的修改。
    </p>
    <p>
      2.2.     在使用红网卫士服务前，您应仔细阅读上海云盾在官方页面上展示的相关服务说明、技术规范、使用流程等，并理解相关内容及可能发生的后果，在使用红网卫士服务过程中，您应依照相关操作指引进行操作，请您自行把握风险谨慎操作，对于您违反相关操作指引所引起的后果，上海云盾将不承担责任。
    </p>
    <p>
      2.3.     您应按照本合同的约定支付相应服务费用。
    </p>
    <p>
      2.4.     您承诺：
    </p>
    <p>
      2.4.1.     不利用本合同中服务从事Web入侵攻击防护、CC防护等防护售卖业务；
      <br>
      2.4.2.     不得将红网卫士产品和服务各个部分分开用于任何目的；
      <br>
      2.4.3.     除上海云盾明示许可外，不得修改、翻译、改编、出租、转许可、在信息网络上传播或转让上海云盾提供的软件，也不得逆向工程、反编译或试图以其他方式发现上海云盾提供的软件的源代码；
      <br>
      2.4.4.     若上海云盾的服务涉及第三方软件之许可使用的，您同意遵守相关的许可协议的约束；
      <br>
      2.4.5.     您利用红网卫士进行防护的业务须为正常的商业、科研等符合国家法律规定的业务，不得用于从事任何非法业务，包括但不限于:
      <br>
      1)     违反国家规定的政治宣传和/或新闻；
      <br>
      2)     涉及国家秘密和/或安全的信息；
      <br>
      3)     封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；
      <br>
      4)     博彩有奖、赌博游戏、“私服”、“外挂”等非法互联网出版活动；
      <br>
      5)     违反国家民族和宗教政策；
      <br>
      6)     妨碍互联网运行安全；
      <br>
      7)     侵害他人合法权益和/或其他有损于社会秩序、社会治安、公共道德的活动；
      <br>
      8)     其他违反法律法规、部门规章或国家政策的内容。
      <br>
      2.4.6.     不建立或利用有关设备、配置运行与所购服务无关的程序或进程，或者故意编写恶意代码导致大量占用云平台中的服务器内存、CPU或者网络带宽资源，给上海云盾云平台或者上海云盾的其他用户的网络、服务器（包括但不限于本地及外地和国际的网络、服务器等）、产品/应用等带来严重的负荷，影响上海云盾与国际互联网或者上海云盾与特定网络、服务器及上海云盾内部的通畅联系，或者导致上海云盾云平台产品与服务或者上海云盾的其他用户网站所在的服务器宕机、死机或者用户基于云平台的产品/应用不可访问等；
      <br>
      2.4.7.     不进行任何破坏或试图破坏网络安全的行为（包括但不限于钓鱼，黑客，网络诈骗，网站或空间中含有或涉嫌散播：病毒、木马、恶意代码，及通过虚拟服务器对其他网站、服务器进行涉嫌攻击行为如扫描、嗅探、ARP欺骗、DDoS等）；
      <br>
      2.4.8.     不进行任何改变或试图改变上海云盾提供的系统配置或破坏系统安全的行为；
      <br>
      2.4.9.     不利用上海云盾提供的服务从事损害上海云盾公司、网站合法权益之行为；
      <br>
      2.4.10.     从事其他违法、违规或违反上海云盾服务条款的行为；
      <br>
      2.4.11.     如上海云盾发现您违反上述条款的约定，有权根据情况采取相应的处理措施，包括但不限于立即中止服务、终止服务等。如因您违反上述保证而给上海云盾或上海云盾合作伙伴造成损失的，您还应自行承担一切法律责任并赔偿损失；
      <br>
      2.4.12.     如果第三方机构或个人对您提出质疑或投诉，上海云盾将通知您，您有责任在规定时间内进行说明并出具证明材料，如您未能提供相反证据或您逾期未能反馈的，上海云盾将采取包括但不限于立即中止服务或终止服务等处理措施。因您未及时更新联系方式或联系方式不正确而致使未能联系到您的，亦视为您逾期未能反馈；
      <br>
      2.4.13.     上海云盾依据第2.4.11条、第2.4.12条对您采取了中止服务、终止服务等措施而给您造成任何损失的，上海云盾不承担任何责任。
    </p>
    <p>
      2.5.     您对自己存放在上海云盾云平台上的数据以及进入和管理上海云盾云平台上各类产品与服务的口令、密码的完整性和保密性负责。因您维护不当或保密不当或操作不当致使上述数据、口令、密码等丢失或泄漏所引起的一切损失和后果均由您自行承担。
    </p>
    <p>
      2.6.     您应向上海云盾提交执行本合同的联系人和管理用户网络及云平台上各类产品与服务的人员名单和联系方式并提供必要的协助。如以上人员发生变动，您应自行将变动后的信息进行在线更新并及时通知上海云盾。因您提供的人员的信息不真实、不准确、不完整，以及因以上人员的行为或不作为而产生的结果，均由您负责。
    </p>
    <p>
      2.7.     您了解上海云盾无法保证其所提供的服务毫无瑕疵（如上海云盾安全产品并不能保证您的硬件或软件的绝对安全），但上海云盾承诺不断提升服务质量及服务水平。所以您同意：即使上海云盾提供的服务存在瑕疵，但上述瑕疵是当时行业技术水平所无法避免的，其将不被视为上海云盾违约。您同意和上海云盾一同合作解决上述瑕疵问题。
    </p>
    <p>
      2.8.     您应仔细阅读上海云盾就红网卫士服务在上海云盾网站上和本合同中的服务说明，自行判断红网卫士服务与您选择适用的操作系统、云服务器等产品或服务的适配性。
    </p>
    <p>
      2.9.     如果您选择购买安全管家服务，您理解并同意，您将授权安全管家服务的技术人员查看和分析产品配置、系统运行状态、黑客攻击日志等服务过程所必须了解的数据，以便为您提供技术服务；如果您通过邮件、工单等方式向安全管家服务的技术人员提供您在上海云盾云平台的账号及密码，您理解并同意，您将授权允许安全管家服务的技术人员登录您的账号进行监控或配置变更服务。
    </p>
    <p>
      <strong>三、     上海云盾权利和义务</strong>
    </p>
    <p>
      3.1.     上海云盾应按照本合同的约定及产品和服务标准，向您提供服务。
    </p>
    <p>
      3.2.     服务期限内，上海云盾根据您选择购买安全管家服务提供对应等级的在线工单服务系统、在线QQ、邮件及售后服务电话，解答用户在使用中的问题。
    </p>
    <p>
      3.3.     上海云盾提供本合同服务条款规定的技术支持，但不承担由于您的原因（包括但不限于代码质量，人为管理疏漏，自身安全管理等）造成的影响和损失。
    </p>
    <p>
      3.4.     上海云盾将尽力消除您非人为操作所出现的故障，但因您的原因和/或不可抗力以及非上海云盾控制范围之内的事项除外。
    </p>
    <p>
      3.5.     在服务期限内，如您受到的高级安全攻击超过您购买的服务标准，上海云盾有权暂停服务，直至攻击达到您购买的服务标准之内。
    </p>
    <p>
      3.6.     上海云盾应严格遵守保密义务，上海云盾不得向任何第三方提供或透露您的数据信息内容，但是根据中华人民共和国国家安全机构、公安部门等国家机关的要求或根据法律强制规定而披露的情形除外。
    </p>
    <p>
      <strong>四、     知识产权</strong>
    </p>
    <p>
      4.1.     您承认上海云盾提供的任何资料、技术或技术支持、软件、服务等的知识产权均属于上海云盾或第三方所有。除上海云盾或第三方明示同意外，您无权复制、传播、转让、许可或提供他人使用上述资源，否则应承担相应的责任。
    </p>
    <p>
      <strong>五、     保密责任</strong>
    </p>
    <p>
      5.1.     任何一方对于因签署或履行本合同从而知悉的对方保密资料和信息（下称保密信息）均应在合同保密期限内保守秘密。未经对方当事人书面同意，任何一方不得将双方的合同内容和保密信息披露、提供或转让给任何第三方。本合同另有约定的除外。任何一方未履行本保密条款义务，均被视为违约。作为违约行为的一方应承担因自己的违约行为而给守约方造成的损失。
    </p>
    <p>
      5.2.     本合同有效期届满或终止后，如提供保密信息方向接受方提出书面要求，接受方应按要求将保密信息的任何本合同涉及的业务文件、资料、软件、客户资料交还提供方，或予以销毁。并且不得继续使用这些保密信息。
    </p>
    <p>
      5.3.     保密期限为本合同有效期及合同终止后两年。
    </p>
      <strong>六、     期限与终止</strong>
    <p>
      6.1.     上海云盾的红网卫士服务自您开通服务之日起即可使用，至法律规定或本合同服务条款约定的终止情形出现之时终止。
    </p>
    <p>
      6.2.     发生下列情形，红网卫士服务终止：
    </p>
    <p>
      6.2.1.     双方协商一致终止；
      <br>
      6.2.2.     由于您严重违反本合同服务条款（包括但不限于a.您未按照本合同服务条款的约定履行付款义务，及/或b.您严重违反本合同服务条款中所做的承诺，及/或c.您严重违反法律规定等），上海云盾有权按本合同服务条款的相关约定单方面终止服务，并不退还您已经支付的费用；
      <br>
      6.2.3.     您理解并充分认可，虽然上海云盾已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括但不限于DDoS）等危害网络安全事项或行为（以下统称该等行为），但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，因此如因您遭遇该等行为而给上海云盾或者上海云盾的其他的网络或服务器（包括但不限于本地及外地和国际的网络、服务器等）带来危害，或影响上海云盾与国际互联网或者上海云盾与特定网络、服务器及上海云盾内部的通畅联系，上海云盾可决定暂停或终止服务，如果终止服务的，将按照实际提供服务月份计算（不足一个月的按一个月计）服务费用，将剩余款项（如有）返还；
      <br>
      6.2.4.     上海云盾由于自身经营政策的变动，通过提前30天发网站内公告、在网站内合适版面发通知或给您发站内通知、书面通知的方式，终止本合同服务条款项下的服务。
    </p>
    <p>
      <strong>七、     违约责任</strong>
    </p>
    <p>
      7.1.     本合同任何一方违约均须依法承担违约责任。
    </p>
    <p>
      7.2.     您逾期付款的，应按所欠价款每日支付3‰的逾期付款违约金。您逾期付款超过30天的，上海云盾有权暂停向您提供服务。在暂停服务30天内您仍未足额补交合同总价款和违约金的，上海云盾有权单方面终止本合同，同时您仍应支付上海云盾实际提供服务月份计算（不足一个月的按一个月计）服务费用和服务期产生的合同金额对应的逾期违约金。
    </p>
    <p>
      7.3.     如果因上海云盾原因造成您连续72小时不能正常使用服务的，您可终止接受服务，并按您已付款金额的日3‰的比率向您支付违约金，但非上海云盾控制之内的原因引起的除外。
    </p>
    <p>
      7.4.     您违反本合同第2.4条款的承诺，上海云盾有权单方面终止本合同。此种情况下，您仍应全额支付合同总价款及逾期付款违约金（如有）。如因您的行为导致上海云盾遭受损失或处罚的，您应当承担全部赔偿责任。
    </p>
    <p>
      7.5.     在任何情况下，上海云盾均不对任何间接性、后果性、惩戒性、偶然性、特殊性的损害，包括您使用上海云盾云服务而遭受的利润损失承担责任（即使您已被告知该等损失的可能性）。
    </p>
    <p>
      7.6.     在任何情况下，上海云盾对本合同服务条款所承担的违约赔偿责任总额不超过向您收取的红网卫士服务之服务费总额。
    </p>
    <p>
      <strong>八、     不可抗力</strong>
    </p>
    <p>
      8.1.     因不可抗力或者其他意外事件，使得本合同服务条款的履行不可能、不必要或者无意义的，遭受不可抗力、意外事件的一方不承担责任。
    </p>
    <p>
      8.2.     不可抗力、意外事件是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行等以及社会事件如战争、动乱、政府行为、电信主干线路中断、黑客、网路堵塞、电信部门技术调整和政府管制等。
    </p>
    <p>
      <strong>九、     法律适用与争议的解决</strong>
    </p>
    <p>
      9.1.     本合同之签署、效力、解释和执行以及本协议项下争议之解决，均应适用中华人民共和国法律。
    </p>
    <p>
      9.2.     合同履行过程中发生争议，双方本着友好协商精神，共同商议有关事项。如果协商不成，由上海云盾所在地法院管辖。
    </p>
    <p>
      <strong>十、     其他约定</strong>
    </p>
    <p>
      10.1.     上海云盾在www.yundun.com相关页面上的服务说明、价格说明和您确认同意的订购页面是本服务条款不可分割的一部分,如果上海云盾在www.yundun.com相关页面上的服务说明、价格说明和您确认同意的订购页面与本合同服务条款有不一致之处，以本合同服务条款为准。
    </p>
    <p>
      10.2.     如果任何条款在性质上或其他方面理应在此协议终止时继续存在，那么应视为继续存在的条款，这些条款包括但不局限于保证条款、保密条款、知识产权条款、法律适用及争议解决条款。
    </p>
    <p>
      10.3.     本合同服务条款项下，上海云盾对您的所有通知均可通过网页公告、网站内通知、电子邮件、手机短信或书面信函等任一方式进行；该等通知于发送之日即视为已送达收件人。
    </p>
  </div>
</div>
</template>
